---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointClouds.IPointCloudEngine
source: html/e4e697e6-53ba-9635-f41c-9ea9a86d296f.htm
---
# IPointCloudEngine Methods

Implement this method to construct the IPointCloudAccess interface for the point cloud designated by
 the identifier. This method is called once during the creation of a PointCloudType.